cases/palette/pallet_2x4/system/singleGraphx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2006
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

// along x
start   (0.001 0.2001 0.2001);
end     (0.7001 0.2001 0.2001);
// along z
//start   (0.01 0.01 0);
//end     (0.01 0.01 0.45);
fields  (T);


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
setFormat csv;

setConfig
{
    type    midPoint;
    axis    x;    // x, y, z, xyz
}

// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
